#Задание 1
age=int(input())
if age < 18:
    print("Вы несовершеннолетний")
elif age > 18 and age <= 65:
    print("Вы трудоспособный человек")
else:
    print("Вы пенсионер")
----------------------------------------------
#Задание 2
summa = int(input())
if summa < 1000:
    print("Скидки нет")
elif summa >= 1000 and summa <= 5000:
    print("Скидка 5%", summa * 0,05 - summa)
else:
    print(summa * 0.1 - summa)
-----------------------------------------------
+++++++++++++++++++++++++++++++++++++++++++++++
#Задание 3
a = int(input("Введите первое число"))
b = int(input("Введите второе число"))
c = input("Введите операцию")
if c == "+":
    print(a+b)
elif c == "-":
    print(a-b)
elif c == "*":
    print(a*b)
elif c == "/":
    print(a/b)
else:
    print("Введена неверная операция")
++++++++++++++++++++++++++++++++++++++++++++++
-------------------------------------------
#Задание 4
x = int(input())
if  x % 2 == 0 and x % 2 == 2 or x % 2 == 6:
    print("True")
else:
    print("False")
--------------------------------------------
#Задание 5
a = int(input())
x = 18452
if a != x:
    print("Доступ запрещён")
else:
    print("Доступ разрешён")
